kwakeham/nrf52_CX/nRF5_SDK/components/drivers_ext/Tmp116/tmp116.c
	if(playEffect)
	{
//		//P3OUT &= 0xFB;		// Set Trigger Pin Low

		switch(waveform.inputMode)
		{
		case MODE_RAM:		// RAM Mode

			I2C_WriteSingleByte(DRV260x_LIBRARY, RAM); 		// Select RAM Library

			for(i = 0; i < waveform.length; i += 2)
			{
				I2C_WriteSingleByte(waveform.data[i], waveform.data[(i+1)]);   // Send (register, value)
			}

			Haptics_EnableTrigger();		// Set RAM trigger (Internal, Ext. Edge, Ext. Level)

			break;
		case MODE_ROM:		// ROM Mode
			for(i = 0; i < waveform.length; i += 3)
			{
				if(waveform.data[i+2] != 0xFF)		// Read register, Operate, Write register
				{
					ReadVal = I2C_ReadSingleByte(waveform.data[i]);
					ReadVal = waveform.data[i+1] | (ReadVal & ~waveform.data[i+2]); 	// Apply Mask to ReadData
					I2C_WriteSingleByte(waveform.data[i], ReadVal);   					// Send (register, value)
				}
				else		// Write over existing register setting
				{
					I2C_WriteSingleByte(waveform.data[i], waveform.data[(i+1)]);   // Send (register, value)
				}
			}

			Haptics_EnableTrigger();		// Set ROM trigger (Internal, Ext. Edge, Ext. Level)

			break;

		case MODE_PWM:		// PWM Mode

			I2C_WriteSingleByte(DRV260x_MODE, PWM_Analog);		// Set PWM input mode

			for(k=0; k<waveform.length; k=k+2)		// Go through waveform data array of time-value pairs
			{
				//TA1CCR1 = waveform.data[k]+ waveform.data[k]/4 + waveform.data[k]/16;  // Set PWM duty cycle - 1.316x
				for(j=0;j<waveform.data[k+1];++j)	// Count number of 5ms intervals
				{
					nrf_delay_ms(50); //timerdelay(tickdelay);			// Time delay before next change in amplitude
				}
			}

			break;

		case MODE_RTP:		// RTP Mode

			I2C_WriteSingleByte(DRV260x_MODE, RTP);		// Set RTP Mode

			for(k=0; k<waveform.length; k=k+2)			// Go through waveform data array of time-value pairs
			{
				I2C_WriteSingleByte(DRV260x_RTP, waveform.data[k]);   	// Send (register, value)
				for(j=0;j<waveform.data[k+1];++j)		// Count number of 5ms intervals
				{
					nrf_delay_ms(50); //timerdelay(tickdelay);				// Time delay before change in amplitude
				}
			}

			break;
		default:

			for(i = 0; i < waveform.length; i += 3)
			{
				if(waveform.data[i+2] != 0xFF)		// Read register, Operate, Write register
				{
					ReadVal = I2C_ReadSingleByte(waveform.data[i]);
					ReadVal = waveform.data[i+1] | (ReadVal & ~waveform.data[i+2]); // Apply Mask to ReadData
					I2C_WriteSingleByte(waveform.data[i], ReadVal);   				// Send (register, value)
				}
				else		// Write over existing register setting
				{
					I2C_WriteSingleByte(waveform.data[i], waveform.data[(i+1)]);   	// Send (register, value)
				}
			}

			Haptics_EnableTrigger();		// Set ROM trigger (Internal, Ext. Edge, Ext. Level)

			break;
		}
	}
}

/**
 * Haptics_HardwareMode - Set the hardware pins to the appropriate setting
 * @param unsigned char inputMode - the waveform input type
 */
void Haptics_HardwareMode(uint8_t inputMode)
{
			//need to re-write for nordic
	switch(inputMode)
	{
	case MODE_PWM:		// PWM Mode
		//need to re-write for nordic
//		P3DIR |= BIT2; 			// P3.2 = Output
//		P3SEL |= BIT2;			// P3.2 = PWM Output
		break;
	case MODE_RTP:		// RTP Mode
		//need to re-write for nordic
	//		P3OUT &= 0xFB;			// P3.2 = Low
//		P3SEL &= 0xFB;			// P3.2 = GPIO
//		P3DIR |= 0x04;			// P3.2 = Output
		break;
	case MODE_ANALOG:	// Analog Mode
		//P3DIR &= 0xFB;			// P3.2 = Hi-Z (MSP430 Pin Hi-Z)
		break;
	case MODE_A2H:
		//P3DIR &= 0xFB;			// P3.2 = Hi-Z (MSP430 Pin Hi-Z)
		break;
	default:			// RAM or ROM modes
		//P3DIR |= 0x04;			// P3.2 = Output
		//P3OUT &= 0xFB;			// P3.2 = Low
		//P3SEL &= 0xFB;			// P3.2 = GPIO
		break;
	}
}

/**
 * Haptics_SendTriggerType - set the trigger settings in the DRV260x
 */
void Haptics_SendTriggerType(void)
{
	/* Set the trigger mode in the DRV260x */
	if(triggerType == TRIGGER_EXTERNAL_EDGE)
	{
		I2C_WriteSingleByte(DRV260x_MODE, Ext_Trig_Edge);
	}
	else if(triggerType == TRIGGER_EXTERNAL_LEVEL)
	{
		I2C_WriteSingleByte(DRV260x_MODE, Ext_Trig_Level);
	}
	else	// Internal trigger
	{
		I2C_WriteSingleByte(DRV260x_MODE, Int_Trig);
	}
}

/**
 * Haptics_SendActuatorSettings - set the actuator settings in the DRV260x
 */
void Haptics_SendActuatorSettings(void)
{
	/* DRV2605 Actuator Settings */
	switch(actuatorType)
	{
	case ACTUATOR_ERM: 	// ERM Mode

		if(IsERMOpenLoop)	// Open Loop Mode
		{
			I2C_WriteSingleByte(DRV260x_OD_CLAMP, ERM_ODClamp_OL);					// Open-loop Overdrive
			I2C_WriteSingleByte(DRV260x_CONTROL3, (control3 | ERM_OpenLoop));		// Set open-loop
		}
		else				// Closed Loop Mode
		{
			I2C_WriteSingleByte(DRV260x_OD_CLAMP, ERM_ODClamp);						// Closed-loop Overdrive
			I2C_WriteSingleByte(DRV260x_CONTROL3, (control3 & ~(ERM_OpenLoop)));	// Set closed-loop
		}

		I2C_WriteSingleByte(DRV260x_RATED_VOLTAGE, ERM_RatedVoltage);
		I2C_WriteSingleByte(DRV260x_AUTOCAL_COMP, ERM_AutoCal_Comp);
		I2C_WriteSingleByte(DRV260x_AUTOCAL_BEMF, ERM_AutoCal_BEMF);
		I2C_WriteSingleByte(DRV260x_FEEDBACK_CONTROL, ERM_AutoCal_FB);
		Haptics_LoadSwitchSelect(ACTUATOR_ERM);
		break;
	case ACTUATOR_LRA: 	// LRA Auto-Resonance

		if(IsLRAOpenLoop)	// LRA Open-Loop (Auto-resonance OFF)
			I2C_WriteSingleByte(DRV260x_CONTROL3, (control3 | LRA_OpenLoop));		// Set open-loop
		else				// LRA Auto-resonance ON
			I2C_WriteSingleByte(DRV260x_CONTROL3, (control3 & ~(LRA_OpenLoop)));	// Set closed-loop

		I2C_WriteSingleByte(DRV260x_RATED_VOLTAGE, LRA_RatedVoltage);
		I2C_WriteSingleByte(DRV260x_OD_CLAMP, LRA_ODClamp);
		I2C_WriteSingleByte(DRV260x_AUTOCAL_COMP, LRA_AutoCal_Comp);
		I2C_WriteSingleByte(DRV260x_AUTOCAL_BEMF, LRA_AutoCal_BEMF);
		I2C_WriteSingleByte(DRV260x_FEEDBACK_CONTROL, LRA_AutoCal_FB);
		Haptics_LoadSwitchSelect(ACTUATOR_LRA);
		break;
	//default: __no_operation();
	}
}

/**
 * Haptics_SetERMOpenLoopMode - set the device to open loop mode
 * @param openLoopMode - ERM_ClosedLoop = closed-loop mode, ERM_OpenLoop = open-loop mode
 */
void Haptics_SetERMOpenLoopMode(uint8_t openLoop)
{
	IsERMOpenLoop = openLoop;
}

/**
 * Haptics_GetERMOpenLoopMode - get the status of ERM open loop flag
 * @return unsigned char 0 = Closed Loop, 1 = Open Loop
 */
unsigned char Haptics_GetERMOpenLoopMode(void)
{
	return IsERMOpenLoop;
}

/**
 * Haptics_SetLRAOpenLoopMode - set the device to LRA open loop mode
 * @param openLoopMode - LRA_AutoResonance = closed-loop mode, LRA_OpenLoop = Divide by 128x
 */
void Haptics_SetLRAOpenLoopMode(uint8_t openLoop)
{
	IsLRAOpenLoop = openLoop;
}

/**
 * Haptics_GetLRAOpenLoopMode - get the status of LRA open loop flag
 * @return unsigned char 0 = AutoResonance, 1 = Divide by 128x
 */
unsigned char Haptics_GetLRAOpenLoopMode(void)
{
	return IsLRAOpenLoop;
}



/**
 * Haptics_EnableTrigger - turn on the trigger, uses last executed trigger type
 */
void Haptics_EnableTrigger(void)
{
	Haptics_EffectActive(1);

